run/CleanCases/STL_Limonene_Cprod_CHCO_ke/0/C10H16
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C10H16;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           $internalField;
    }
    inlet2
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    door
    {
        type            fixedValue;
        value           $internalField;
    }
    windowsmall
    {
        type            fixedValue;
        value           $internalField;
    }
    windowbig
    {
        type            fixedValue;
        value           $internalField;
    }
    columns
    {
      type            fixedValue;
      value           $internalField;
    }
    ceiling
    {
        type            fixedValue;
        value           $internalField;
    }
    floor
    {
        type            fixedValue;
        value           $internalField;
    }
    wallwindow
    {
        type            fixedValue;
        value           $internalField;
    }
    walldoor
    {
        type            fixedValue;
        value           $internalField;
    }
    walloutside
    {
        type            fixedValue;
        value           $internalField;
    }
    wallinside
    {
        type            fixedValue;
        value           $internalField;
    }
    emission_surface
    {
        type            fixedValue;
        value           uniform 1.0e-06; //0.00001384954
        //V = m*Rspec*T/P -> 0.23 mg, M 136.24, 296 K 0.3*0.01 m^2 opening
        //(((2.3*10^-7)*(8314/136.23)*296)/(1*10^5))/(0.3*0.01) = 0.00001384954 m/s @ 1 ppm?
    }
}


// ************************************************************************* //
